# Importar Datos

3 formas de Importar Datos

**CSV**

**EXCEL**

**PORTAPAPELES**

A partir de ahí vendran otros archivos como pickle, pero si entendes la dinámica de estos 3 el resto será más sencillo.

## Como importar un CSV

## Importar un csv

In [4]:
import pandas as pd 
df = pd.read_csv('/Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/Frutos_Secos.csv', delimiter=';', index_col='id' )

df

,Nombre Cliente,Tipo Producto,Precio (€/kg),Cantidad Vendida (kg),Fecha Venta,Provincia Cliente
id,,,,,,
389932,Mas y Mas,Almendras,4.54,1212,29/3/23,Cádiz
389933,Mercadona,Nueces,5.84,591,5/12/23,Sevilla
389934,Alcampo,Cacahuetes,2.69,2831,26/7/23,Madrid
389935,Mas y Mas,Pistachos,6.70,516,7/10/23,Alicante
389936,Lidl,Nueces,6.14,1283,12/5/23,Barcelona
...,...,...,...,...,...,...
390227,Caprabo,Nueces,9.75,2367,15/9/23,Sevilla
390228,Alcampo,Pistachos,3.82,1951,19/9/23,Madrid
390229,Mas y Mas,Pistachos,5.22,2811,4/5/23,Valencia
390230,Mas y Mas,Cacahuetes,8.07,473,18/1/23,Madrid
390231,Aldi,Nueces,5.80,1081,23/3/23,Sevilla

In [5]:
#Información general
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 300 entries, 389932 to 390231
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Nombre Cliente         300 non-null    object
 1   Tipo Producto          300 non-null    object
 2   Precio (€/kg)          300 non-null    float64
 3   Cantidad Vendida (kg)  300 non-null    int64
 4   Fecha Venta            300 non-null    object
 5   Provincia Cliente      300 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 16.4+ KB

In [8]:
# Lee el archivo csv con la columna 'Fecha Venta' como fechas parseadas
df = pd.read_csv ('/Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/Frutos_Secos.csv', delimiter=';', index_col='id', parse_dates=['Fecha Venta'])

# Muestra las primeras filas del dataFrame para verificar que la fecha se haya parseado correctamente
df.head()

,Nombre Cliente,Tipo Producto,Precio (€/kg),Cantidad Vendida (kg),Fecha Venta,Provincia Cliente
id,,,,,,
389932,Mas y Mas,Almendras,4.54,1212,2023-03-29,Cádiz
389933,Mercadona,Nueces,5.84,591,2023-05-12,Sevilla
389934,Alcampo,Cacahuetes,2.69,2831,2023-07-26,Madrid
389935,Mas y Mas,Pistachos,6.70,516,2023-07-10,Alicante
389936,Lidl,Nueces,6.14,1283,2023-12-05,Barcelona

In [9]:
#Información general. Vemos que la columna fecha de venta ahora es del tipo datetime64
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 300 entries, 389932 to 390231
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Nombre Cliente         300 non-null    object
 1   Tipo Producto          300 non-null    object
 2   Precio (€/kg)          300 non-null    float64
 3   Cantidad Vendida (kg)  300 non-null    int64
 4   Fecha Venta            300 non-null    datetime64[ns]
 5   Provincia Cliente      300 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 16.4+ KB

## Importar desde un Excel

In [11]:
# Parseamos la fecha al momento de la carga
df_excel = pd.read_excel('/Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/Frutos_Secos.xlsx', index_col='id', parse_dates=['Fecha Venta'])

In [12]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 300 entries, 389932 to 390231
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Nombre Cliente         300 non-null    object
 1   Tipo Producto          300 non-null    object
 2   Precio (€/kg)          300 non-null    float64
 3   Cantidad Vendida (kg)  300 non-null    int64
 4   Fecha Venta            300 non-null    datetime64[ns]
 5   Provincia Cliente      300 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 16.4+ KB

In [13]:
df_excel.head()

,Nombre Cliente,Tipo Producto,Precio (€/kg),Cantidad Vendida (kg),Fecha Venta,Provincia Cliente
id,,,,,,
389932,Mas y Mas,Almendras,4.54,1212,2023-03-29,Cádiz
389933,Mercadona,Nueces,5.84,591,2023-05-12,Sevilla
389934,Alcampo,Cacahuetes,2.69,2831,2023-07-26,Madrid
389935,Mas y Mas,Pistachos,6.70,516,2023-07-10,Alicante
389936,Lidl,Nueces,6.14,1283,2023-12-05,Barcelona

## Importar desde el Portapapeles

In [14]:
df_portapapeles = pd.read_clipboard(header=None)
df_portapapeles.head(2)

,0,1,2,3,4
0,('/Users/jimenacambronero/Desktop/Proyectos,para,Portfolio/PythonPracticas/Datos/Frutos_Secos.c...,"delimiter=';',",index_col='id'

# Bases de datos relacionales -SQL Alchemy-

SQLAlchemy es una biblioteca de Python que proporciona una forma flexible y de alto rendimiento para trabajar con bases de datos relacionales. Se utiliza comúnmente como un Object Relational Mapper (ORM), que es una técnica que facilita la interacción con bases de datos utilizando objetos y consultas en lugar de escribir directamente en SQL.

In [1]:
import sqlalchemy as sa

In [26]:
# Crear la conexion a la base de datos
conexion= sa.create_engine('sqlite:////Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/pruebassqlalchemy.db')

In [35]:
# Hacer la query para cargar los datos
df_sql= pd.read_sql('SELECT * FROM Registros_Ventas',conexion)

In [36]:
# Trabajar normalmente como un dataframe de Pandas
df_sql.head()

,Nombre Cliente,Tipo Producto,Precio (€/kg),Cantidad Vendida (kg),Fecha Venta,Provincia Cliente
0,Mas y Mas,Almendras,4.54,1212,2023-03-29,Cádiz
1,Mercadona,Nueces,5.84,591,2023-12-05,Sevilla
2,Alcampo,Cacahuetes,2.69,2831,2023-07-26,Madrid
3,Mas y Mas,Pistachos,6.70,516,2023-10-07,Alicante
4,Lidl,Nueces,6.14,1283,2023-05-12,Barcelona

# Guardar Datos

CSV

    df.to_csv('Prueba.csv')

EXCEL

    df.to_excel('Prueba.xlsx')

# Situaciones Frecuentes

## Separadores No Estandar

A menudo, cuando trabajas con archivos, la información está organizada en columnas y las columnas están separadas por caracteres especiales como comas, punto y coma o tabulaciones.

Pero a veces, en lugar de comas o punto y coma, pueden usar cualquier otro carácter para separar las columnas. Entonces, lo primero que debes hacer es descubrir qué carácter están usando para separar las columnas, para que podamos leer el archivo correctamente. Esto se hace utilizando el parámetro "sep".

La mayoría de las veces, esta información sobre el carácter separador se encuentra en la documentación del archivo o en las instrucciones proporcionadas.

In [37]:
pd.read_csv( '/Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/ejemplo_tabulador.csv', sep='\t').head(5)

   Nombre  Edad     Ciudad
0    Juan    25     Madrid
1     Ana    30  Barcelona
2  Carlos    22    Sevilla

## Cuando los datos NO comienzan en la Primera Fila

In [38]:
# skiprows se salta la primera fila, cabecera, directamente carga como cabecera el primer registro
pd.read_csv('/Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/ejemplo_tabulador.csv', 
            sep='\t',
            skiprows=1).head(5)

     Juan  25     Madrid
0     Ana  30  Barcelona
1  Carlos  22    Sevilla

## Columnas Sin Nombre

A veces puede suceder que no queremos cargar los nombres de las columnas sino que los queremos poner más tarde

In [39]:
# header = none no cargara nada 
pd.read_csv('/Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/ejemplo_tabulador.csv', 
            sep='\t',
            header=None).head(5)

        0     1          2
0  Nombre  Edad     Ciudad
1    Juan    25     Madrid
2     Ana    30  Barcelona
3  Carlos    22    Sevilla

In [40]:
# Cómo poner nombres en la importación
# Como ahora la cabecera corre fila tenemos que ponerle 2 en skiprows, si no no importara la fila 84

cabecera = ['Estas', 'son mis', 'cabeceras']

pd.read_csv('/Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/ejemplo_tabulador.csv', 
            sep='\t',
            skiprows=2,
            header=0,
            names=cabecera).head(5)

    Estas  son mis cabeceras
0  Carlos       22   Sevilla

## Nulos no Habituales

Si tenes una serie de números 'falsos' como en alguos casos el -999 los podes identificar como nulos.

In [42]:
cabecera = ['ID', 'Nombre', 'Años', 'Puntos']

# cargara Nan cdo encuentro un -999
pd.read_csv('/Users/jimenacambronero/Desktop/Proyectos para Portfolio/PythonPracticas/Datos/ejemplo_valores_nulos.csv', 
            sep=',',
            header=0,
            names=cabecera,
            na_values=-999).head(5)

   ID   Nombre  Años  Puntos
0   1    Alice  25.0    95.0
1   2      Bob   NaN    82.0
2   3  Charlie  30.0     NaN
3   4    David  22.0    90.0
4   5      Eva  35.0    88.0